
#include "内存验证器.h"
// 优化构建中关闭高开销的内存验证。
#ifdef NDEBUG
void 验证新堆豫言值(豫言值 参数, bool 递归, int 深度){
}
void 验证豫言值(豫言值 参数, bool 递归, int 深度){
}
void 验证垃圾回收结果(){
}
void 验证当前堆(){
}

void 验证豫言栈(){
}
#else

#define 验证递归上限 10

static void 验证指定堆中的豫言值(豫言值 参数, bool 递归, int 深度, 豫言值 *堆开始, 豫言值 *堆结束) {
    if (深度 >= 验证递归上限) {
        return;
    }
    if (豫言值是堆指针(参数)) {
        if (豫言值是堆字节串(参数)) {
            assert(豫言值是字节串头(*豫言值转堆指针(参数)));
            assert(获取豫言_字节串长度(参数) == 获取豫言_字节串长度(*豫言值转堆指针(参数)));
            assert(豫言值转字节串指针(参数)[获取豫言_字节串长度(参数)] == 0);
        }
        if (豫言值是构造器元组(参数)){
            uint64_t 元组长度 = 获取构造器元组长度(参数);
            if (元组长度 == 0){
                assert(豫言值转堆指针(参数) == NULL);
            }
        }

        豫言值* 指针 = 豫言值转堆指针(参数);
        if (指针 == NULL){
            uint64_t 长度 = 获取堆对象占用块数(参数);
            assert(长度 == 0);
        } else if (堆开始 <= 指针 && 指针 < 堆结束) {
            uint64_t 长度 = 获取堆对象占用块数(参数);
            assert(指针 + 长度 <= 堆结束);
            if (递归 && 豫言值是元组(参数)) {
                for (int 序数 = 0; 序数 < 长度; 序数++) {
                    验证指定堆中的豫言值(读取堆对象(参数, 序数), 递归, 深度 + 1, 堆开始, 堆结束);
                }
            }
        } else {
            fprintf(stderr, "无效堆指针 %p", 豫言值转通用指针(参数));
            abort();
        }
    } else if (豫言值是字节串(参数)) {
        assert(豫言值转字节串指针(参数)[获取豫言_字节串长度(参数)] == 0);
    } else {
        assert(获取豫言值类型(参数) <= C栈指针类型标记);
        assert(获取豫言值类型(参数) != 转移地址类型标记);
    }
}

void 验证新堆豫言值(豫言值 参数, bool 递归, int 深度){
    验证指定堆中的豫言值(参数, 递归, 深度, 新堆, 新堆结束);
}

void 验证豫言值(豫言值 参数, bool 递归, int 深度){
    验证指定堆中的豫言值(参数, 递归, 深度, 当前堆, 当前堆结束);
}

// 验证所有根值有效，且栈中不包含指向旧堆的指针。
void 验证垃圾回收结果(){
    验证当前堆();
    for (int 序数 = 0; 序数 < 垃圾回收根数量; 序数++) {
        验证豫言值(*(垃圾回收根[序数]), true, 0);
    }
    豫言值* 回收栈指针 = (豫言值*)豫言栈开始;
    while(回收栈指针 < 豫言_栈指针){
        验证豫言值(*(回收栈指针), true, 0);
        回收栈指针++;
    }

}

void 验证豫言栈(){
    豫言值* 栈指针迭代器 = (豫言值*)豫言栈开始;
    while(栈指针迭代器 < 豫言_栈指针){
        验证豫言值(*(栈指针迭代器), false, 0);
        栈指针迭代器++;
    }

}

void 验证当前堆(){
    for (uint64_t 序数 = 0; 序数 < 豫言_当前分配指针 - 当前堆 ; ) {
        豫言值* 下个扫描指针 = 当前堆 + 序数;
        if (豫言值是字节串头(*下个扫描指针)){
            uint64_t 长度 = 获取豫言_字节串长度(*下个扫描指针);
            assert(((unsigned char *)(下个扫描指针 + 1))[长度] == 0);
            序数 += 获取字节串占用块数(*下个扫描指针);
        }
        else
        {
            验证豫言值(*(下个扫描指针), false, 0);
            序数 += 1;
        }
    }
}
#endif
