

#include "公共包含.h"
#include "内存验证器.h"


int 编译器内部错误(){
    printf("发生编译器内部错误：程序可能被错误编译，类型检查可能不可靠。\n");
    exit(1);
    return -1;
}

uint64_t C运行时内部错误(){
    fprintf(stderr, "发生 C 运行时内部错误：运行时实现可能不正确，类型检查可能不可靠。\n");
    exit(1);
    return -1;
}

uint64_t 报错并中止(char* 错误消息){

    fprintf(stderr, "%s\n", 错误消息);
    exit(1);
    return -1;
}

uint64_t 豫言_运行时报错并中止(豫言值 错误消息, 豫言值 值){

    fprintf(stderr, "%s\n", 豫言值转字符串(错误消息));
    打印豫言值(值, 0);
    abort();
    return -1;
}

// 第一个参数是闭包自身，实际异常值位于栈帧第六项。
void 全局异常处理器(豫言值 栈顶, 豫言值 当前分配参数){
    豫言值 异常值 = 豫言值转栈指针(栈顶)[6];
    fprintf(stderr, "未捕捉的豫言异常：\n");
    fprintf(stderr, "尝试打印异常值（打印过程也可能失败）：\n");
    fflush(stderr);
    fprintf(stderr, "%s", 豫言值转字符串(异常值));
    fprintf(stderr, "\n");
    exit(1);
}


豫言值 当前异常处理器;


void 初始化全局异常处理器(){

    豫言值 全局函数指针 = 函数指针转豫言值(全局异常处理器);
    当前异常处理器 = 元组转豫言值(1, (豫言值[]){全局函数指针});
    豫言值 验证值 = 读取元组(当前异常处理器, 0);
    豫言_登记垃圾回收根(&当前异常处理器);
}

豫言值 豫言_获取当前异常处理器() {
    验证豫言值(当前异常处理器, true, 0);
    豫言值 返回值 = 读取元组(当前异常处理器, 0);
    return 当前异常处理器;
}

豫言值 豫言_设置当前异常处理器(豫言值 处理器) {
    当前异常处理器 = 处理器;
    return 单元转豫言值();
}
