
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include "类型定义.h"

extern const int 空值类型标记;
extern const int 元组类型标记;
extern const int 整数类型标记;
extern const int 小数类型标记;
extern const int 堆字符串类型标记;
extern const int 静态字符串类型标记;
extern const int 爻类型标记;
extern const int 函数指针类型标记;
extern const int 静态对象指针类型标记;
extern const int 栈指针类型标记;
extern const int 转移地址类型标记;
extern const int 堆字符串头类型标记;


// 类型与长度。
uint64_t 获取豫言值类型(豫言值 参数);
void 设置豫言值类型(豫言值 *参数, uint64_t 类型);
uint64_t 获取豫言值子类型(豫言值 参数);
void 设置豫言值子类型(豫言值 *参数, uint64_t 子类型);
uint64_t 获取豫言值原始长度(豫言值 参数);
void 设置豫言值原始长度(豫言值 *参数, uint64_t 长度);
uint64_t 获取豫言_字符串长度(豫言值 参数);


// 读取豫言值。
char *豫言值转字符串(豫言值 参数);
int64_t 豫言值转整数(豫言值 参数);
double 豫言值转小数(豫言值 参数);
bool 豫言值转爻(豫言值 参数);
豫言值 *豫言值转元组(豫言值 参数);
uint64_t 获取豫言元组长度(豫言值 参数);
uint64_t 获取堆字符串占用块数(豫言值 参数);
豫言函数指针类型 豫言值转函数指针(豫言值 参数);
豫言值 *豫言值转静态指针(豫言值 参数);
豫言值 *豫言值转栈指针(豫言值 参数);
豫言值 *豫言值转转移地址(豫言值 参数);
void *豫言值转通用指针(豫言值 参数);
豫言值 *豫言值转堆指针(豫言值 参数);
uint64_t 获取堆对象占用块数(豫言值 参数);
char *豫言值转堆字符串指针(豫言值 参数);
uint64_t 获取构造器元组长度(豫言值 参数);

// 判断类型。
bool 豫言值是堆指针(豫言值 参数);
bool 豫言值是元组(豫言值 参数);
bool 豫言值是堆字符串头(豫言值 参数);
bool 豫言值是字符串指针(豫言值 参数);
bool 豫言值是构造器元组(豫言值 参数);
uint64_t 字符串缓冲长度转块数(uint64_t 长度);

// 构造豫言值。
豫言值 单元转豫言值();
豫言值 原始堆字符串转豫言值(uint64_t 字节长度, const char *字符串);
豫言值 复制字符串为豫言值(uint64_t 字节长度, const char *字符串);
豫言值 静态字符串转豫言值(const char *字符串);
豫言值 整数转豫言值(int64_t 整数);
豫言值 小数转豫言值(double 小数);
豫言值 爻转豫言值(bool 爻值);
豫言值 函数指针转豫言值(豫言函数指针类型 函数);
豫言值 静态指针转豫言值(豫言值 *指针);
豫言值 栈指针转豫言值(豫言值 *指针);
豫言值 原始元组转豫言值(uint64_t 长度, const 豫言值* 元素);
豫言值 元组转豫言值(uint64_t 长度, const 豫言值 元素[]);
豫言值 转移地址转豫言值(豫言值 *转移地址);
豫言值 堆指针转豫言值(uint64_t 类型, uint64_t 子类型, uint64_t 原始长度, 豫言值 *指针);
豫言值 运行时堆指针转豫言值(豫言值 *指针);

// 列操作。
uint64_t 获取同构列长度(const 豫言值 列);
豫言值 *获取同构列元素(const 豫言值 列);
豫言值 数组转同构列(uint64_t 长度, const 豫言值 元素[]);

// 元组操作。
豫言值 读取元组(豫言值 元组, uint64_t 序数);
void 写入元组(豫言值 元组, uint64_t 序数, 豫言值 值);
豫言值 读取堆对象(豫言值 指针, uint64_t 序数);
void 写入堆对象(豫言值 指针, uint64_t 序数, 豫言值 值);
