// 最终应由汇编中的基本运算直接替换。
#include "公共包含.h"

豫言值 豫言_整数相等(豫言值 整数一值, 豫言值 整数二值){
    int64_t 整数一 = 豫言值转整数(整数一值);
    int64_t 整数二 = 豫言值转整数(整数二值);

    return 爻转豫言值(整数一 == 整数二);
}
豫言值 豫言_整数加(豫言值 整数一, 豫言值 整数二){
    return 整数转豫言值(豫言值转整数(整数一) + 豫言值转整数(整数二));
}
豫言值 豫言_整数减(豫言值 整数一, 豫言值 整数二){
    return 整数转豫言值(豫言值转整数(整数一) - 豫言值转整数(整数二));
}
豫言值 豫言_整数乘(豫言值 整数一, 豫言值 整数二){
    return 整数转豫言值(豫言值转整数(整数一) * 豫言值转整数(整数二));
}
豫言值 豫言_整数除(豫言值 整数一, 豫言值 整数二){
    return 整数转豫言值(豫言值转整数(整数一) / 豫言值转整数(整数二));
}


豫言值 豫言_整数转字符串(豫言值 整数值){

    int64_t 数字 = 豫言值转整数(整数值);
    int64_t 缓冲区大小 = snprintf(NULL, 0, "%lld", (long long)数字) + 1;
    char *字符串缓冲区 = malloc(缓冲区大小);
    snprintf(字符串缓冲区, 缓冲区大小, "%lld", (long long)数字);
    豫言值 返回值 = 复制字符串为豫言值(缓冲区大小, 字符串缓冲区);
    free(字符串缓冲区);
    return 返回值;
}

豫言值 豫言_小数加(豫言值 小数一, 豫言值 小数二){
    return 小数转豫言值(豫言值转小数(小数一) + 豫言值转小数(小数二));
}
豫言值 豫言_小数减(豫言值 小数一值, 豫言值 小数二值){
    double 小数一 = 豫言值转小数(小数一值);
    double 小数二 = 豫言值转小数(小数二值);
    return 小数转豫言值(小数一 - 小数二);
}
豫言值 豫言_小数乘(豫言值 小数一值, 豫言值 小数二值){
    double 小数一 = 豫言值转小数(小数一值);
    double 小数二 = 豫言值转小数(小数二值);
    return 小数转豫言值(小数一 * 小数二);
}
豫言值 豫言_小数除(豫言值 小数一, 豫言值 小数二){
    return 小数转豫言值(豫言值转小数(小数一) / 豫言值转小数(小数二));
}

豫言值 豫言_小数转字符串(豫言值 小数值){

    double 数字 = 豫言值转小数(小数值);
    int64_t 缓冲区大小 = snprintf(NULL, 0, "%lf", 数字) + 1;
    char *字符串缓冲区 = malloc(缓冲区大小);
    snprintf(字符串缓冲区, 缓冲区大小, "%lf", 数字);
    豫言值 返回值 = 复制字符串为豫言值(缓冲区大小, 字符串缓冲区);
    free(字符串缓冲区);
    return 返回值;
}

豫言值 豫言_小数转整数(豫言值 小数) {
    return 整数转豫言值((int64_t)豫言值转小数(小数));
}

豫言值 豫言_整数转小数(豫言值 整数) {
    double 值 = (double)豫言值转整数(整数);
    return 小数转豫言值(值);
}

豫言值 豫言_字符串转整数(豫言值 字符串值){
    char *字符串 = 豫言值转字符串(字符串值);
    int64_t 数字 = strtol(字符串, NULL, 10);
    return 整数转豫言值(数字);
}

豫言值 豫言_字符串转小数(豫言值 字符串值){
    char *字符串 = 豫言值转字符串(字符串值);
    double 数字 = strtod(字符串, NULL);
    return 小数转豫言值(数字);
}
