
#include "公共包含.h"
#include "内存验证器.h"

// 判断字符串一是否为字符串二的子串。
豫言值 豫言_是子字符串(豫言值 字符串一值, 豫言值 字符串二值) {
    if (strstr(豫言值转字符串(字符串二值), 豫言值转字符串(字符串一值)) != NULL) {
        return 爻转豫言值(true);
    } else {
        return 爻转豫言值(false);
    }
}

豫言值 豫言_字符串相等(豫言值 字符串一值, 豫言值 字符串二值) {
    char *字符串一文本 = 豫言值转字符串(字符串一值);
    char *字符串二文本 = 豫言值转字符串(字符串二值);
    if (strcmp(字符串二文本, 字符串一文本) == 0)
    {
        return 爻转豫言值(true);
    }
    else
    {
        return 爻转豫言值(false);
    }
}

豫言值 豫言_字符串字节长度(豫言值 字符串值){
    char *字符串 = 豫言值转字符串(字符串值);
    return 整数转豫言值(strlen(字符串));
}

豫言值 豫言_字符串字节数组长度(豫言值 字符串值){
    char *字符串 = 豫言值转字符串(字符串值);
    return 整数转豫言值(strlen(字符串));
}


豫言值 豫言_字符串获取字节数组(豫言值 字符串值){
    return 字符串值;
}

豫言值 豫言_字符转整数(豫言值 字符串值, 豫言值 序数指针){
    char *字符串 = 豫言值转字符串(字符串值);
    uint64_t 序数 = 豫言值转整数(序数指针);
    char 结果 = 字符串[序数];
    return 整数转豫言值((unsigned char)结果);
}

豫言值 豫言_字节转字符串(豫言值 字节值) {
    int64_t 字节 = 豫言值转整数(字节值);
    if (字节 <= 0 || 字节 > 255) {
        报错并中止("字节转字符串只接受一至二百五十五之间的整数");
    }
    char 结果[2] = {(char)(unsigned char)字节, '\0'};
    return 复制字符串为豫言值(sizeof(结果), 结果);
}

豫言值 豫言_子字符串从字节序数开始(豫言值 字符串值, 豫言值 序数值){

    char* 字符串 = 豫言值转字符串(字符串值);
    int64_t 序数 = 豫言值转整数(序数值);
    char *结果 = &字符串[序数];
    return 复制字符串为豫言值(strlen(结果) + 1, 结果);
}

豫言值 豫言_字符串匹配(豫言值 查找值, 豫言值 开始序数值, 豫言值 匹配值) {
    char* 查找文本 = 豫言值转字符串(查找值);
    int64_t 开始序数 = 豫言值转整数(开始序数值);
    char* 匹配 = 豫言值转字符串(匹配值);
    char *匹配目标 = &查找文本[开始序数];

    char *目标指针 = 匹配目标;
    char *模式指针 = 匹配;
    // 比较目标和模式的共同前缀。
    while (*目标指针 && *模式指针 && *目标指针 == *模式指针) {
        目标指针++;
        模式指针++;
    }
    if (!*模式指针) {
        return 爻转豫言值(true);
    } else {
        return 爻转豫言值(false);
    }

}

豫言值 豫言_字符串获取字节序数当前字符(豫言值 字符串值, 豫言值 序数值){
    char* 字符串 = 豫言值转字符串(字符串值);
    int64_t 序数 = 豫言值转整数(序数值);
    char *结果 = &字符串[序数];
    char *结束 = 结果;
    while(*结束){
        结束+=1;
        // 最高两位不是二进制“10”时，表示下一个 UTF-8 字符开始。
        if ((*结束  &  0xC0) != 0x80) {
            break;
        }
    }

    int64_t 长度 = 结束 - 结果;
    char *新字符串 = malloc(结束-结果 + 1);

    if (新字符串 != NULL) {
        memcpy(新字符串, 结果, 长度);
        新字符串[长度] = '\0';
    }
    豫言值 返回值 = 复制字符串为豫言值(长度 + 1, 新字符串);
    free(新字符串);
    return 返回值;
}

// 开始序数 必须是引号，返回获取的字符串与前进的字符数
豫言值 豫言_字符串获取JSON字符串(豫言值 字符串值, 豫言值 开始序数值){
    char* 字符串 = 豫言值转字符串(字符串值);
    int64_t 开始序数 = 豫言值转整数(开始序数值);
    char *开始 = &字符串[开始序数];
    if (*开始 != '"'){
        报错并中止("JSON字符串必须以引号开始");
    }
    char *结束 = 开始;
    while(*结束){
        结束+=1;
        if (*结束 == '\\') {
            结束+=1;
            continue;
        }
        if (*结束 == '"') {
            break;
        }
    }
    if (*结束 != '"'){
        报错并中止("JSON字符串必须以引号结束");
    }
    int64_t 字节长度 = 结束-开始 + 1;
    char* 转义字符串 =  malloc(字节长度);
    char* 原指针 = 开始+1;
    char* 转义指针 = 转义字符串;
    while(原指针 != 结束){
        if (*原指针 == '\\') {
            原指针+=1;
            switch (*原指针)
            {
            case 'n':
                *转义指针 = '\n';
                break;
            case 't':
                *转义指针 = '\t';
                break;
            case 'r':
                *转义指针 = '\r';
                break;
            case 'b':
                *转义指针 = '\b';
                break;
            case 'f':
                *转义指针 = '\f';
                break;
            case '\\':
                *转义指针 = '\\';
                break;
            case '/':
                *转义指针 = '/';
                break;
            case '"':
                *转义指针 = '"';
                break;
            default:
                报错并中止("JSON字符串中的转义字符不合法");
                break;
            }
        } else {
            *转义指针 = *原指针;
        }
        原指针+=1;
        转义指针+=1;
    }
    *转义指针 = '\0';
    豫言值 转义字符串值 = 复制字符串为豫言值(strlen(转义字符串) + 1, 转义字符串);
    free(转义字符串);
    return 元组转豫言值(2, (豫言值[]){转义字符串值, 整数转豫言值(字节长度)});
}

size_t 统计UTF8通字符数量(const char *字符串) {
    size_t 数量 = 0;
    while (*字符串) {
        数量 += (*字符串++ & 0xC0) != 0x80;
    }
    return 数量;
}

豫言值 豫言_获取通字符(豫言值 字符串地址) {
    const char* 开始 = 豫言值转字符串(字符串地址);
    const char* 结束 = 开始;
    while(*结束){
        结束+=1;
    }

    // 统计 UTF-8 通字符数量。
    int 通字符数量 = 0;
    const char* 扫描指针 = 开始;
    while (扫描指针 != 结束) {
        if ((*扫描指针 & 0xC0) != 0x80) {
            通字符数量++;
        }
        扫描指针++;
    }

    // 为通字符分配堆数组。
    豫言值 通字符 = 分配豫言元组(通字符数量);

    // 提取各个通字符。
    扫描指针 = 开始;
    const char* 通字符开始 = 扫描指针;
    int 序数 = 0;
    while (扫描指针 != 结束) {
        if ((*扫描指针 & 0xC0) != 0x80) {
            if (扫描指针 != 通字符开始) {
                int 长度 = 扫描指针 - 通字符开始;
                char* 新字符 = malloc((长度 + 1) * sizeof(char));
                strncpy(新字符, 通字符开始, 长度);
                新字符[长度] = '\0';
                豫言值 新字符值 = 复制字符串为豫言值(长度 + 1, 新字符);
                free(新字符);
                写入元组(通字符, 序数, 新字符值);
                序数++;
            }
            通字符开始 = 扫描指针;
        }
        扫描指针++;
    }

    // 处理最后一个通字符。
    if (扫描指针 != 通字符开始) {
        int 长度 = 扫描指针 - 通字符开始;
        char* 新字符 = malloc((长度 + 1) * sizeof(char));
        strncpy(新字符, 通字符开始, 长度);
        新字符[长度] = '\0';
        豫言值 新字符值 = 复制字符串为豫言值(长度 + 1, 新字符);
        写入元组(通字符, 序数, 新字符值);
        free(新字符);
    }

    豫言值 返回值 =  元组转豫言值(2, (豫言值[]){通字符, 整数转豫言值(通字符数量)});
    验证豫言值(返回值, true, 0);
    return 返回值;
}

豫言值 豫言_字符串拼接(豫言值 字符串一值, 豫言值 字符串二值) {
    验证豫言值(字符串一值, true, 0);
    验证豫言值(字符串二值, true, 0);
    uint64_t 字符串一长度 = 获取豫言_字符串长度(字符串一值);
    uint64_t 字符串二长度 = 获取豫言_字符串长度(字符串二值);
    uint64_t 结果长度 = 字符串一长度 + 字符串二长度;

    豫言值 返回值 = 分配豫言_字符串缓冲区(结果长度 + 1);
    char *结果字符串 = 豫言值转堆字符串指针(返回值);
    const char *字符串一文本 = 豫言值转字符串(字符串一值);
    const char *字符串二文本 = 豫言值转字符串(字符串二值);

    assert(strlen(字符串一文本) == 字符串一长度);
    assert(strlen(字符串二文本) == 字符串二长度);

    memcpy(结果字符串, 字符串一文本, 字符串一长度);
    memcpy(结果字符串 + 字符串一长度, 字符串二文本, 字符串二长度);
    结果字符串[结果长度] = '\0';

    验证豫言值(返回值, true, 0);
    return 返回值;
}

豫言值 豫言_通字符拼接(豫言值 字符串列地址) {
    验证豫言值(字符串列地址, true, 0);
    const int 长度 = 获取同构列长度(字符串列地址);
    豫言值* 字符串组 = 获取同构列元素(字符串列地址);

    int 总长度 = 0;

    for (int 序数 = 0; 序数 < 长度; 序数++) {
        豫言值 当前字符串 = 字符串组[序数];
        assert(strlen(豫言值转字符串(当前字符串)) == 获取豫言_字符串长度(当前字符串));
        总长度 += 获取豫言_字符串长度(当前字符串);
    }

    豫言值 返回值 = 分配豫言_字符串缓冲区(总长度 + 1);

    char* 结果字符串 = 豫言值转堆字符串指针(返回值);
    char* 当前位置 = 结果字符串;

    for (int 序数 = 0; 序数 < 长度; 序数++) {
        const char* 当前字符串 = 豫言值转字符串(字符串组[序数]);
        assert(strlen(当前字符串) == 获取豫言_字符串长度(字符串组[序数]));
        int 字符串长度 = 获取豫言_字符串长度(字符串组[序数]);
        memcpy(当前位置, 当前字符串, 字符串长度);
        当前位置 += 字符串长度;
    }

    *当前位置 = '\0';


    assert(当前位置 - 结果字符串 == 总长度);
    验证豫言值(返回值, true, 0);
    return 返回值;
}
