
#include "公共包含.h"
#include "内存验证器.h"


豫言值 豫言_新建引用(豫言值 值){
    豫言值 存储 = 分配豫言元组(1);
    写入元组(存储, 0, 值);
    return 存储;
}

豫言值 豫言_读取引用(豫言值 地址){
    return 读取元组(地址, 0);
}

豫言值 豫言_写入引用(豫言值 新值, 豫言值 地址){
    写入元组(地址, 0, 新值);
    return 单元转豫言值();
}

豫言值 豫言_新建引用数组(豫言值 值, 豫言值 长度值){
    int64_t 长度 = 豫言值转整数(长度值);
    豫言值 存储 = 分配豫言元组(长度);
    for (int 序数 = 0; 序数 < 长度; 序数++)
    {
        写入元组(存储, 序数, 值);
    }
    return 存储;
}

豫言值 豫言_读取引用数组(豫言值 地址, 豫言值 序数值){
    int64_t 序数 = 豫言值转整数(序数值);
    return 读取元组(地址, 序数);
}

豫言值 豫言_写入引用数组(豫言值 新值, 豫言值 序数值, 豫言值 引用地址){
    int64_t 序数 = 豫言值转整数(序数值);
    写入元组(引用地址, 序数, 新值);
    return 单元转豫言值();
}


豫言值 豫言_新建未初始化引用数组(豫言值 长度值){
    int64_t 长度 = 豫言值转整数(长度值);
    return 分配豫言元组(长度);
}


豫言值 豫言_不安全转换(豫言值 值){
    return 值;
}
