#include "公共包含.h"
#include "调试打印.h"

豫言值 豫言_打印行(豫言值 字符串) {
    fprintf(stdout,"%s\n", 豫言值转字符串(字符串));
    fflush(stdout);
    return 单元转豫言值();
}

豫言值 豫言_标准错误打印行(豫言值 字符串) {
    fprintf(stderr,"%s\n", 豫言值转字符串(字符串));
    fflush(stderr);
    return 单元转豫言值();
}

豫言值 豫言_打印字符串(豫言值 字符串) {
    fprintf(stdout,"%s", 豫言值转字符串(字符串));
    fflush(stdout);
    return 单元转豫言值();
}

豫言值 豫言_读取全部标准输入() {
    // 分配初始缓冲区。
    size_t 缓冲区大小 = 1024;
    char* 缓冲区 = (char*)malloc(缓冲区大小);
    if (缓冲区 == NULL) {
        报错并中止("无法分配内存");
        return 单元转豫言值();
    }

    size_t 总大小 = 0;
    size_t 已读字节数;

    // 读取标准输入直到文件末尾。
    while ((已读字节数 = fread(缓冲区 + 总大小, sizeof(char), 缓冲区大小 - 总大小, stdin)) > 0) {
        总大小 += 已读字节数;

        // 必要时扩展缓冲区。
        if (总大小 == 缓冲区大小) {
            缓冲区大小 *= 2;
            char* 新缓冲区 = (char*)realloc(缓冲区, 缓冲区大小);
            if (新缓冲区 == NULL) {
                free(缓冲区);
                报错并中止("无法重新分配内存");
            }
            缓冲区 = 新缓冲区;
        }
    }

    // 以空字符结束字符串。
    缓冲区[总大小] = '\0';

    char *结果 = malloc(总大小 + 1);
    memcpy(结果, 缓冲区, 总大小 + 1);

    豫言值 返回值 = 复制字符串为豫言值(总大小 + 1, 结果);
    free(结果);
    free(缓冲区);
    return 返回值;
}

豫言值 豫言_读取标准输入行() {
    char* 行 = NULL;
    size_t 缓冲区大小 = 0;
    ssize_t 已读字节数 = getline(&行, &缓冲区大小, stdin);
    if (已读字节数 == -1) {
        free(行);
        报错并中止("无法从标准输入读取一行");
        return 单元转豫言值();
    }

    豫言值 返回值;
    // 若末尾存在换行符则将其删除。
    if (已读字节数 > 0 && 行[已读字节数 - 1] == '\n') {
        行[已读字节数 - 1] = '\0';
        返回值 = 复制字符串为豫言值(已读字节数, 行);
    } else {
        行[已读字节数] = '\0';
        返回值 = 复制字符串为豫言值(已读字节数 + 1, 行);
    }

    free(行);
    return 返回值;
}

豫言值 豫言_打印通用值(豫言值 消息, 豫言值 对象) {
    fprintf(stderr, "[豫言通用值打印] %s: ", 豫言值转字符串(消息));
    打印豫言值(对象, 0);
    fprintf(stderr, "\n");
    return 单元转豫言值();
}
